In [21]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame({
    'Nombre': ['Alicia','Pedro','Carlos'],
    'Fecha_nacimiento': ['10/25/2005','10/29/2002','01/01/2001']
})

df['Fecha_nacimiento'] = pd.to_datetime(df['Fecha_nacimiento'])

In [11]:
df.head()

   Nombre Fecha_nacimiento
0  Alicia       2005-10-25
1   Pedro       2002-10-29
2  Carlos       2001-01-01

In [13]:
df['anyo_nacimiento'] = df['Fecha_nacimiento'].map(lambda x: x.strftime('%Y'))

In [14]:
df

   Nombre Fecha_nacimiento anyo_nacimiento
0  Alicia       2005-10-25            2005
1   Pedro       2002-10-29            2002
2  Carlos       2001-01-01            2001

In [15]:
df['mes_nacimiento'] = df['Fecha_nacimiento'].map(lambda x: x.strftime('%m'))

In [17]:
df

   Nombre Fecha_nacimiento anyo_nacimiento mes_nacimiento
0  Alicia       2005-10-25            2005             10
1   Pedro       2002-10-29            2002             10
2  Carlos       2001-01-01            2001             01